Repository: tryswift/try-swift-tokyo
Catalog: MyLibrary/Sources/ScheduleFeature/Localizable.xcstrings
Source language: en
Languages: ja

source: - iOS and Flutter engineer in Japan - Working in DeNA Co., Ltd. - Often participate in [Japan-\\(region).swift](https://japan-region-swift.github.io/Japan-region-swift/) events in Japan. - Spoke at conferences in Japan such as [iOSDC](https://iosdc.jp/2024/) from 2022 to 2024 and [FlutterKaigi2024](https://youtu.be/UwDqyVawLtA?si=E0kN98o9CdM_p8e6). - I like cooking, fish, Japanese food, and pineapples.
ja: - 日本でiOSとFlutterのエンジニアをしています。 - 株式会社ディー・エヌ・エーに勤務。 - 日本で開催される[Japan-\\(region).swift](https://japan-region-swift.github.io/Japan-region-swift/)のイベントに頻繁に参加。 - 2022年から2024年にかけて[iOSDC](https://iosdc.jp/2024/)や[FlutterKaigi2024](https://youtu.be/UwDqyVawLtA?si=E0kN98o9CdM_p8e6)など、日本のカンファレンスで登壇。 - 料理、魚、和食、パイナップルが好き。

source: "Hmm, something looks off..." "Hmm, this interaction is broken..." If you've built UI with SwiftUI, you've probably encountered these issues more often than you'd like. In many cases, the solution involves wrapping UIKit to work around the problem. In this lightning talk, I'll discuss when to use SwiftUI and when to rely on UIKit, breaking it down into eight common patterns.
ja: 「あれ、なんか表示がおかしいぞ」「あれ、なんかインタラクションが壊れているぞ」 SwiftUIでUIを構築していると上記の課題に遭遇することが稀によくあります。その場合はUIKitをラップして問題を解決することが多いと思います。 このLTでは、どういう時にどちらのフレームワークを使うのかについて8つのパターンに分けてお話しします。

source: ⚡️ EXIT 8 for SwiftUI
ja: ⚡️ SwiftUIの8番出口

source: ⚡️ Exploring SwiftUI Path Animations featuring Japan Symbol Quiz
ja: ⚡️ Japan Symbol QuizによるSwiftUIのPathアニメーションの探求

source: ⚡️ Graph Art with Charts API – Beyond Data Visualization
ja: ⚡️ Charts APIで作るグラフアート – データビジュアライゼーションを超えて

source: ⚡️ I Built an App for NeXTSTEP or: How I Learned to Stop Worrying and Love Objective-C
ja: ⚡️ NeXTSTEP向けアプリを作った話 ― Objective-Cを恐れるのをやめ、愛するようになった理由

source: ⚡️ Let’s Try Making Things Move with Swift!
ja: ⚡️ Swiftで物を動かしてみよう!

source: ⚡️ Spice up your notifications
ja: ⚡️ 通知に彩りを加えよう

source: ⚡️ Swift × Android: How Skip is Shaping the Future of Cross-Platform Development
ja: ⚡️ Swift × Android: Skipが切り拓くクロスプラットフォーム開発の未来

source: ⚡️ What I Did to Shut Down a Personally Developed App with Over 400K Downloads
ja: ⚡️ 40万以上DLされた個人開発アプリをサービス終了するためにしたこと

source: ⚡️ Write iOS Game Once and Play in Any Way
ja: ⚡️ 一度作れば、どんな入力でもプレイ可能なiOSゲーム

source: A brief overview of how to write modern UI applications on Windows taking advantage of recent technologies. This assumes that the developer is not familiar with Windows development. By drawing parallels between the macOS and Windows worlds, it aims to show how Windows UI application development can be familiar and easy with Swift.
ja: 最近の技術を活用してWindowsでモダンなUIアプリケーションを書く方法の概要を紹介します。この文章は、開発者がWindows開発に慣れていないことを前提としています。macOSとWindowsの世界との類似点を描きながら、Swiftを使ってWindows UIアプリケーション開発が親しみやすく、簡単になることを示すことを目指しています。

source: Advanced Software Engineer at Garmin. 10 years of iOS development experience since college. Love solving the LeetCode problems with Swift.
ja: Garminのアドバンストソフトウェアエンジニアです。 大学時代からiOS開発に取り組み、10年以上の経験があります。 Swiftを使ってLeetCodeの問題を解くのが好きです。

source: After a year of developing an editor component with the TextKit 2 framework, I gained knowledge of best practices and techniques. I am thrilled to share my experience and insights.
ja: TextKit 2フレームワークを使ってエディターコンポーネントを1年間開発した経験から、最適な方法やテクニックを学びました。その知識やノウハウを皆さんとシェアできることをとても楽しみにしています。

source: After transitioning to remote work several years ago, I found myself spending most of my time at home. However, I wanted to ensure I maintained a healthy lifestyle by aiming for 10,000 steps per day. To easily track my daily steps without the need for an app store, I developed a personal app for myself. Initially, I experimented with an iOS app using Swift Charts. However, as updates to the operating system rolled out, I found that I rarely used the app. Instead, with the convenience of the Apple Watch widget, I seamlessly transitioned to tracking my steps directly from my wrist. I'll discuss the logical progression of how I continuously refined the app for personal use, adapting it to evolving OS features, and how it positively impacted my daily routine.
ja: 在宅ワークが始まって早数年。 ほぼ家にいるが、健康のためにも1日1万歩の歩数を確保したい。 そこで、ストアにもあげず、ただただ自分が今何歩歩いているかを気軽に知るために自分専用のアプリを開発して使っています。 Swift Chartsを使ってみたiOSのアプリは結局開かなくなったり、 WatchOSのWidgetで直接歩数を見れるようになったのでWatchのWidgetで見るようにしたりとOSのアップデートと共に自分のためだけに改善していった様子とアプリを使ってからの生活環境の変化を話します。

source: AI-Assisted Swift in Gamifying an iOS App
ja: AI支援のSwiftによるiOSアプリのゲーミフィケーション

source: Akimu is an iOS software developer at LY Corporation. He is working on the chat related features of LINE app. In his free time, he is a developer of simutrans OTRP, a Japanese fork of Simutrans, an open source transport simulator written in C++. He is a scholarship winner of WWDC18 from Japan.
ja: 株式会社LINEヤフーのiOS developer。LINEアプリのチャット関連機能を開発中。C++で書かれたオープンソースのトランスポートシミュレータ、Simutransの日本語フォークであるsimutrans OTRPの開発者。WWDC18日本代表。

source: App Art: Great App Design Done Quick
ja: 素早く実現する優れたアプリデザイン

source: Apple Vision Pro new interface based on hand tracking
ja: Apple Vision Pro: ハンドトラッキングを基盤とした新インターフェース

source: As a software engineer, I divide my time between working on client applications, backend services, and occasionally indulging in watching cat videos and photos. I have led engineering teams and cats to deliver user-facing products with a special focus on usability, customer satisfaction, and meowing.
ja: ソフトウェアエンジニアとして、クライアントアプリやバックエンドサービスの開発に携わる一方で、時々猫の動画や写真を観て楽しんでいます。エンジニアチームと猫を率いて、ユーザー向けプロダクトの開発をリードしてきました。特に、使いやすさ、顧客満足、そして“ニャー”を大切にしています。

source: As most people tend to use cloud sync services to store relevant content, we will explore File Provider framework on both iOS and macOS and all the related features: Finder and Files app integration, remote synchronisation with upload and downloads. So let’s explore how it works on both iOS and macOS and how you can sync, upload and download files on these platforms.
ja: 多くの人が関連するコンテンツを保存するためにクラウド同期サービスを使用するようになった今、iOSとmacOSの両方でファイルプロバイダフレームワークと、Finderやファイルアプリ統合、リモート同期やアップロード、ダウンロードなどの関連機能を探索します。iOSとmacOSの両方でどのように機能し、これらのプラットフォームでファイルを同期、アップロード、ダウンロードするかを見ていきましょう。

source: Audrey discovered iOS when she first bought an iPhone Edge in 2008. Since then, she is working passionately on Apple platforms, enjoying SwiftUI and even CoreData while building the macOS Proton Drive app. When she is not coding, watching/playing basketball and football are her favorite activities. As a huge movie addict, Audrey is avoiding trailers as much as possible.
ja: オードリーは2008年に初めてiPhone Edgeを購入したときにiOSに出会った。それ以来、彼女はアップルのプラットフォームに情熱的に取り組んでおり、macOS Proton Driveアプリを作りながらSwiftUIやCoreDataを楽しんでいる。コーディングをしていないときは、バスケットボールとフットボールを観戦するのが好き。 大の映画ファンであるオードリーは、できるだけ予告編を見ないようにしている。

source: Automation for App Localization
ja: アプリローカライゼーションの自動化

source: Belongs to Cyber AI Productions. XR Expert at Cyber Agent. Responsible for system development related to XR and studio shooting. Purchased Apple Vision Pro locally on its U.S. release day. Actively engaged in development and research, including the visionOS 30 Days project. Organizer of the visionOS Engineer Meetup. Published a book on visionOS app development. Has spoken at iOSDC for nine consecutive years, as well as at try! Swift Tokyo, XR Kaigi, Let’s visionOS, AWE USA, and more. Mainly shares updates on X, so please follow!
ja: Cyber AI Productions所属。XR Expert at Cyber Agent。 XR関連とスタジオ撮影関連のシステム開発を担当。 Apple Vision Proを米国発売日に現地購入。visionOS 30 Days開発など精力的に実装と調査をしています。 visionOS Engineer Meetup主催。visionOSアプリ開発の書籍出版。 iOSDC9年連続登壇の他、try! Swift Tokyo、XR Kaigi、Let's visionOS、AWE USAなど登壇あり。 Xを中心に発信しているのでフォローしてください。

source: Big Little Wins for You or Your App
ja: 塵も積もればアプリとなる

source: Binary size is one of the critical metrics to improve the app experience. There are a bunch of approaches to optimize program size and Swift provides some of them including Swift-specific one. This talk gives you an overview of well-known optimizations and how to write size-friendly Swift code.
ja: アプリの体験を向上させる上で、バイナリサイズは重要な指標の一つです。プログラムサイズを最適化するためのさまざまな方法があり、SwiftにはSwift特有の方法も含めていくつかの方法が提供されています。この講演では、よく知られた最適化の概要と、サイズに優しいSwiftコードの書き方について紹介します。

source: Brandon and Stephen, maintainers of the Composable Architecture, will give a broad overview of the library and demonstrate its core tenets: concise domain modeling with value types, composition of features, dependency management, and testability. We will do this by building a very simple application from scratch, and increasingly adding on more complex features.
ja: Composable ArchitectureのメンテナーであるBrandonとStephenが、ライブラリの概要を説明し、そのコアとなる考え方、例えば、値型による簡潔なドメインモデリング、機能の組み合わせ、依存関係の管理、テスト容易性などを実演します。非常にシンプルなアプリケーションをゼロから構築し、より複雑な機能を追加していきます。

source: Brandon spent a long time doing mathematics, but now likes to teach programming with a nod towards math. He co-hosts a video series called Point-Free, which focuses on the Swift language and how to best make use of its type system and features.
ja: Brandonは長い間数学に携わっていましたが、現在は数学に傾倒しながらプログラミングを教えるのが好きです。彼は、Swift言語とその型システムと機能を最大限に活用する方法に焦点を当てたPoint-Freeというビデオシリーズを共催しています。

source: Break
ja: 休憩

source: Bring life to your iOS Application with 3D content using RealityKit
ja: RealityKitでiOSアプリに命を吹き込む

source: Bring your breakfast and meet other attendees or sponsors.
ja: 朝食を持ち寄って、他の参加者やスポンサーと楽しみましょう

source: Build your next website with Swift
ja: Swiftで次世代のウェブサイトを構築しよう

source: Build your own Swift Regex: A Gentle Introduction to Swift Regex
ja: 作って学ぶ正規表現 -やさしいSwift Regex入門-

source: Building a Smaller App Binary
ja: 小さなアプリバイナリを構築する

source: Building Apps for visionOS with Swift
ja: SwiftでvisionOSのアプリをつくろう

source: Capturing Immersive Videos of J1 Pro Soccer Team FC Machida Zelvia: Building a Swift Viewer and Hosting a Hands-On Session
ja: J1プロサッカーチームFC町田ゼルビアのImmersive動画を撮影しSwiftでViewerを実装し体験会実施した

source: Chris is an independent iOS app developer based out of Nara, Japan (originally from USA). Before going indie in 2018, he was a software engineer at various tech companies for about 10 years, mostly in the security space. Chris is best known for his two apps in the area of Japanese language learning, Nihongo and Nihongo Lessons. Nihongo is a Japanese dictionary and study tool that’s made for learning from the words you’re encountering in real life. Nihongo Lessons is a companion app for learning Japanese, based on the work of Adam Shapiro and his Japanese Level Up learning program. Chris loves learning languages, and loves helping people to learn languages. He’s also an avid gamer, hiker, and dad to an amazing 7 year old.
ja: クリスは奈良を拠点に活動するフリーランスのiOSアプリ開発者。2018年に独立する前は、様々なテック企業でソフトウェアエンジニアとして約10年間、主にセキュリティ分野で活躍していた。クリスは、日本語学習分野の2つのアプリ「にほんご」と「にほんごレッスン」で最もよく知られている。Nihongoは日本語辞書と学習ツールで、実生活で遭遇する言葉から学ぶために作られている。Nihongo Lessonsは、Adam Shapiro氏の日本語学習プログラムJapanese Level Upをベースにした、日本語学習のためのアプリです。 クリスは言語学習が大好きで、人々の言語学習を手助けすることも大好きです。彼はまた、熱心なゲーマーであり、ハイカーであり、7歳の素晴らしい子供の父親でもある。

source: Closing
ja: クロージング

source: Cocoa Developer and Teacher. Love technology and cars. Working in the automotive software industry. Living in Tokyo. Company: Woven by Toyota - This talk is not affiliated with my employer in any way. GitHub: [@jeffreybergier](https://github.com/jeffreybergier) Mastodon: [@jeff](https://jeffburg.social/@jeff)
ja: Cocoa Developer & Teacher として活動しています。 テクノロジーと車が大好きで、現在は自動車ソフトウェア業界で働いています（勤務地：東京）。 所属：Woven by Toyota（本講演は所属企業とは関係ありません） GitHub：[@jeffreybergier](https://github.com/jeffreybergier) Mastodon：[@jeff](https://jeffburg.social/@jeff)

source: Code Signing - Have Fun and Take Control
ja: コード署名を楽しく乗り切る方法

source: Combine Vision Pro (visionOS) with Generative AI to instantly transform text prompts into 3D objects in real-time. Discover how Swift and cutting-edge AI come together to create immersive user experiences beyond the boundaries of traditional apps.
ja: Vision Pro (visionOS) と生成型AIを組み合わせることで、テキストプロンプトをリアルタイムで瞬時に3Dオブジェクトへ変換します。 Swiftと最先端のAI技術が融合し、従来のアプリケーションの枠を超えた没入型ユーザー体験を実現する方法をご紹介します。

source: Creating Retro-Style Photos Using Swift
ja: 何が写真をレトロたらしめるのか、Swiftを用いたその実現方法

source: Cultivating a Sense for Designing Great Applications
ja: 良いアプリケーションをデザインするための感覚の持ち方

source: Curious about how SwiftUI really works under the hood? Join me as we explore the render loop and its impact on performance! We’ll break down the rendering process and uncover techniques to optimise your views and eliminate lag. You’ll walk away with a solid understanding of rendering mechanics that will elevate your interface development skills.
ja: SwiftUI の内部動作に興味がありますか？このセッションでは、レンダーループの仕組みとパフォーマンスへの影響について一緒に探っていきます。レンダリングのプロセスを分解し、ビューを最適化してラグをなくすためのテクニックを明らかにしていきます。セッション終了後には、レンダリングの仕組みに対する確かな理解が得られ、インターフェイス開発のスキルが一段と向上していることでしょう。

source: Day 1
ja: １日目

source: Day 2
ja: ２日目

source: Day 3
ja: ３日目

source: Designing Modular Data Pipeline
ja: モジュラーなデータパイプライン設計

source: Download Luma app and show QR code of your ticket at the reception. You will receive a name tag and a goodie bag.
ja: Lumaアプリをダウンロードし、受付でチケットのQRコードを提示してください。ネームタグとお楽​​しみ袋がプレゼントされます。

source: Drive Through File Provider
ja: File Providerを通じたクラウド同期

source: Emad is a Mobile Lead and Solution Architect at Visma Acubiz in Denmark and he is always eager to learn new topics. When he’s not in front of a computer he is usually playing board games
ja: EmadはデンマークのVisma Acubizのモバイル・リード兼ソリューション・アーキテクトで、常に新しいトピックを学ぶことに熱心である。コンピュータの前にいないときは、たいていボードゲームをしている。

source: Enhancing Applications with the Accessibility API
ja: Accessibility APIを使ってアプリケーションを拡張する

source: Escaped big-tech to build photography and video apps. Credits: Halide, Kino and Spectre.
ja: 大手テック企業を離れ、写真や動画アプリの開発に専念。代表作：Halide、Kino、Spectre。

source: Ever wondered about simulations of how weather changes or viruses spread in the air? These simulations are built with simple calculations—just addition, subtraction, multiplication, and division! In this talk, we'll use Swift to create a simple simulation and show you how easy it is!
ja: 天候の変化やウイルスが空気中に広がる様子のシミュレーションを想像したことはありますか？ これらのシミュレーションは、足し算、引き算、掛け算、割り算といったシンプルな計算で構築されています！ 本セッションでは、Swiftを使ってシンプルなシミュレーションを実際に作成し、その簡単さを実演します。

source: Every year at WWDC Apple introduces lots of cool new APIs! But most of these new APIs also come with quite a gatekeeper: they can only be used on the latest version of iOS... Because of that, a lot of useful APIs fail to reach a strong adoption, and by the time their version of iOS has become mainstream they've been completely overlooked. So how about we fix that?
ja: 毎年 WWDC では、Apple からたくさんのクールな新しい API が発表されます！ でも、そうした新APIの多くには「ある壁」が立ちはだかります。それは、「最新の iOS バージョンでしか使えない」ということです…。 そのせいで、本当に便利な API であっても広く使われることがなく、対応する iOS バージョンが主流になる頃には、すっかり見過ごされてしまっていることも少なくありません。 それって、ちょっともったいないと思いませんか？

source: Everyone knows that animations are an easy way to add a touch of surprise and delight to your apps, but with SwiftUI we can add fine-grained effects to individual characters – we can literally animate letters one by one to bring our UI to life in ways that were impossible before iOS 18. In this talk I'll demonstrate how to use SwiftUI's TextRenderer protocol to build a range of effects that help bring your UI to life in fun, engaging ways.
ja: アニメーションは、アプリにちょっとした驚きや楽しさを加える簡単な方法だということは、誰もが知っていることです。 でも SwiftUI を使えば、もっと細かく、文字単位でエフェクトを加えることができます。iOS 18 以降では、なんと文字を一つひとつアニメーションさせることができるのです - これまで実現できなかった、新しい表現が可能になります。 このトークでは、SwiftUI の TextRenderer プロトコルを使って、UI をより楽しく魅力的に演出するさまざまなエフェクトの作り方をご紹介します。

source: Foreign Function and Memory APIs and Swift/Java interoperability
ja: Foreign FunctionとMemory APIとSwift/Java相互運用性

source: Getting started with controlling LEGO using Swift
ja: Swiftでレゴを動かそう！

source: Getting Started with Vapor
ja: Vaporを始めよう

source: Getting to Know TextKit
ja: TextKitの理解を深めよう

source: giginet works at LY Corp to improve Developer Experience for LINE. He also contributes some open-sourced developer tools like fastlane, Carthage, XcodeGen, and so on.
ja: LINEヤフー社でLINEのデベロッパーエクスペリエンス向上に従事。また、fastlane, Carthage, XcodeGenなどのオープンソース開発ツールにも貢献している。

source: Group Photo
ja: 写真撮影

source: Gui Rambo is a Mac developer and security researcher from Brazil, known for apps such as AirBuddy and VirtualBuddy.
ja: Gui Ramboはブラジル出身のMac開発者兼セキュリティ研究者で、AirBuddyやVirtualBuddyといったアプリで知られています。

source: Have you ever built a socket communication app? The sense of accomplishment when you delve into layers that aren't typically touched in your everyday app development and actually utilize them in an app is truly exceptional. However, creating a socket communication app requires knowledge of POSIX sockets, and for complex communications, you need to implement parallel processing. In this talk, we'll implement socket communication and parallel processing in Swift. With Swift, which we're all familiar with, you can easily venture into unfamiliar territories, and there are several instances where you can leverage Swift's capabilities through implementing socket communication and parallel processing. Take this opportunity to enjoy learning socket communication and rediscover the charm of Swift!
ja: 皆さんはソケット通信アプリを作ったことはありますか？普段のアプリ開発では触らないレイヤーを学びアプリとして実際に使った時の達成感は格別です。しかしソケット通信アプリにはPOSIXソケットの知識が必要で、複雑な通信を行うなら並列処理を前提とした実装も必要です。 本トークではSwiftでソケット通信と並列処理を実装します。私たちが使い慣れているSwiftであれば慣れない分野にも気軽に挑戦できますし、ソケット通信や並列処理の実装でSwiftの機能を活かせる場面がいくつかあります。この機会にソケット通信を楽しく学びSwiftの魅力を再発見してください！

source: Have you ever pondered why '1 + 1 = 2' in Swift? Join me as I unveil the intriguing journey behind this seemingly simple arithmetic operation, delving into Swift's inner workings, including its source code, LLVM, and assembly language. This talk offers a deep dive into the concealed mechanics behind everyday code!
ja: Swiftでの「1 + 1 = 2」の計算方法について考えたことはありますか？私のトークでは、単純な足し算からSwiftの内部機能まで、SwiftのソースコードやLLVM、アセンブリ言語を含めた興味深い旅路を明らかにします。日常のコードの隠れたメカニクスに深く入り込んだ内容ですので、ぜひご参加ください！

source: He has been passionate about programming since his childhood and has experience in various programming languages. Ever since discovering Swift, he has been extremely enthusiastic about it.He particularly enjoys writing code that utilizes type systems. As he believes Swift has applications beyond just iOS apps, he also uses Swift on the server side for his regular work. He considers the major appeal of server-side work to be the ability to utilize the latest language features without having to wait for end-users to upgrade their devices. He is deeply interested in Swift as a language and has read almost all of the Swift Evolution proposals from the draft stage. He is also interested in compiler code, and regularly monitors the pull requests to the repository. For his past contributions, he has been recognized as a committer. He runs a study group about the Swift compiler and presents about various topics. Additionally, he's managing a Discord server for discussions about Swift.
ja: 子供の頃からプログラミングが好きで、様々な言語に触れてきた。 Swiftに出会ってからはこれに夢中だ。 特に型システムを活かしたコードを書く事を楽しんでいる。 Swiftが適用可能な領域はiOSアプリにとどまらないと考えていて、 普段の仕事ではサーバサイドにもSwiftを導入している。 サーバサイドではユーザーの端末のバージョンアップを待つ必要がないので、 最新の言語機能が使える事が大きな魅力だと考えている。 Swiftの言語としての側面に興味があり、Swift Evolutionのプロポーザルはドラフトの段階からほぼ全て読んでいる。 コンパイラのコードにも興味があり、リポジトリへのプルリクエストを定期的にチェックしている。 過去にコントリビュートした際にコミッターに認定されている。 Swiftコンパイラについての勉強会を運営していて、様々なトピックについて発表をしている。 また、Swiftについて会話するDiscordサーバの管理運営もしている。

source: He is a software engineer and works on improvements of DevOps and DevEx in various teams. He also contributes some open-sourced swift projects.
ja: ソフトウェアエンジニアとして、さまざまなチームでDevOpsやDevExの改善に取り組んでいる。また、オープンソース化されたswiftプロジェクトにも貢献している。

source: He was fascinated by the smooth and beautiful UI of Mac OS X and started working with Cocoa to create it by himself. After working as a commercial iOS developer, he now works as a software designer and architect, aiming to create beautiful software with smooth UI. He is also a member of "macOS native" community organizers.
ja: かつてMac OS Xのなめらかで美しいUIに憧れ、それを自らの手で作るためにCocoaに入門。商業iOSデベロッパーを経て、現在はソフトウェアデザイナー兼アーキテクトとして、なめらかなUIを備えた美しいソフトウェアの実現を志している。Macとネイティブアプリケーションをこよなく愛す。macOS native運営コアメンバー。

source: HelloSwift.EXE: Writing a Windows Application as a non-Windows Developer
ja: HelloSwift.EXE: Windows開発者じゃなくてもWindowsアプリケーションを書いてみよう

source: Hi, I’m Andrew coming from San Francisco! and I like making apps. This is my second time in Japan, excited to be here. よろしくお願いします！
ja: こんにちは！サンフランシスコ出身のAndrewです。アプリを作るのが好きです。今回で日本に来るのは2回目ですが、また来られてとても嬉しいです。よろしくお願いします！

source: High Dynamic Range imaging has the potential to change way we look at images in a way comparable to the move from HDTV change how we viewed television. This talk dives into the concept of dynamic range, how it is supported on Apple platforms, and quirks you'll run into that aren't covered in the documentation.
ja: ハイダイナミックレンジ（HDR）イメージングは、テレビの視聴方法を変えたHDTVへの移行に匹敵するほど、私たちの画像の見方を一変させる可能性を秘めています。本トークでは、ダイナミックレンジの概念、Appleプラットフォームにおけるサポート方法、そしてドキュメントでは触れられていない特有の問題点について掘り下げます。

source: Hiromu is a member of Rakuten Group, Inc. and is involved in the development of Rakuten Rakuma as an iOS engineer and tech lead.
ja: 楽天グループ株式会社に所属。iOSエンジニア、テックリードとして楽天ラクマの開発に携わる。

source: Hisaki joined Konami Digital Entertainment and was involved in the online implementation of Winning Eleven for 5 years, developed and operated apps as an engineer at COLOPL for 9 years, developed AR games using location information and AR, and VR games such as OculusRift and PSVR After his experience in development, he joined MESON. He is developing SunnyTune, a launch title for VisionPro at MESON.
ja: 株式会社コナミデジタルエンタテインメントに入社し5年間ウイニングイレブンのオンライン実装に携わる。 その後、株式会社コロプラで9年間エンジニアとしてアプリ開発・運用を行い、位置情報やARを使用したARゲーム開発、OculusRiftやPSVRなどのVRゲーム開発を経験しMESONへ入社。 MESONではVisionPro向けローンチタイトルのSunnyTuneを開発。

source: I am an engineer/developer specializing in iOS and visionOS. I have created numerous personal apps, including “Large Contacts” for iOS and “Good Sleeper 360” for visionOS. I’ve authored several technical books, such as Slack & Zoom & Trello Basics + Tips for Telework (in the できるfit series) and What We Wanted to Know About Alexa, and more recently, The Path to Becoming a visionOS Developer. I have received many accolades, including the Mashup Award and top honors in contests organized by Japan’s Ministry of Internal Affairs and Communications, as well as multiple awards in SPAJAM and other hackathons. I have spoken at various events like JAWS Festa and Alexa Day, and I currently share insights on visionOS through social media.
ja: iOSとvisionOSを専門とするエンジニア・開発者です。個人で多数のアプリを開発しており、iOS向けの「Large Contacts」やvisionOS向けの「Good Sleeper 360」などをリリースしています。 また、技術書の執筆も手がけており、「Slack & Zoom & Trello 基本+活用術（できるfitシリーズ）」や「Alexaに聞きたかったこと」、最近では「visionOS開発者への道」などを出版しています。 受賞歴も多数あり、Mashup Awardや総務省主催のコンテストでの最優秀賞、SPAJAMをはじめとするハッカソンでの受賞経験があります。 また、JAWS FestaやAlexa Dayなどのイベンで登壇経験があり、現在はvisionOSに関する知見をSNSで発信しています。

source: I decided to shut down my personally developed app, WebCollector, which had over 400K downloads. In this talk, I'll share the steps I took to ensure a smooth closure. Rather than simply shutting down the service, I took measures to help users properly save their data, provided clear announcements, and disclosed the process to close the app gradually. I'll also reflect on the importance of planning for app closure when running a Firebase-powered personal project.
ja: 40万以上DLされた個人開発アプリ「WebCollector」を終了すると決めたので、そのために実施したことについてお話しします。 単にサービスを停止するのではなく、ユーザーがデータを適切に保存できるよう配慮したり、お知らせを掲載し、プロセスを開示することで段階的にクローズするように配慮しました。 Firebaseを活用した個人開発アプリの運営において、クローズを意識する重要性を考えさせられた経験についてもお話しします。

source: I develop iOS apps at DeNA Co., Ltd. My native language is Swift.
ja: 株式会社ディー・エヌ・エーで iOS アプリを開発しています。Swiftが母国語です。
